Revit 2027 API
Element.OwnerViewId Property
 The id of the view that owns the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OwnerViewId { get; }
Public ReadOnly Property OwnerViewId As ElementId
	Get
public:
property ElementId^ OwnerViewId {
	ElementId^ get ();
}
member OwnerViewId : ElementId with get
Property Value
ElementId
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace